doc/shortcuts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Shortcuts</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Shortcuts"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-06"/>
<meta name="author" content="Léo Perrin &lt;leoperrin@picarresursix.fr&gt;"/>
<meta name="description" content="A list of all the shortcuts in my desktop &mdash; in case I have to set it up by hand again."/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Shortcuts</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Shortcuts</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>  I try to remap all unity functions to keys involving super ("window"
  key, denoted "s") rather than Alt in order to "free" Alt for emacs
  use.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Shortcuts</h2>
<div class="outline-text-2" id="text-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">CATEGORY</th><th scope="col" class="left">Shortcut</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">Desktops</td><td class="left">C-s [ijkl]</td><td class="left">Move to desktop [up/left/down/right]</td></tr>
</tbody>
<tbody>
<tr><td class="left">Moving windows<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup></td><td class="left">C-S-s [ijkl]</td><td class="left">Move to desktop [up/left/down/right] and take along current window</td></tr>
<tr><td class="left"></td><td class="left">C-s [uo]</td><td class="left">Resize current window to a half screen and puts it on the left/right</td></tr>
</tbody>
<tbody>
<tr><td class="left">Modify windows<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup></td><td class="left">C-s _</td><td class="left">Close window</td></tr>
<tr><td class="left"></td><td class="left">C-s ç</td><td class="left">Minimize window</td></tr>
<tr><td class="left"></td><td class="left">C-s à</td><td class="left">Maximize window</td></tr>
</tbody>
<tbody>
<tr><td class="left">Launch emacs</td><td class="left">C-s e</td><td class="left">Starts emacsclient at ~/org/*todo.org</td></tr>
<tr><td class="left"></td><td class="left">C-s a</td><td class="left">Starts emacsclient at ~/org/agenda.org</td></tr>
<tr><td class="left"></td><td class="left">S-s e</td><td class="left">Opens a new emacs instance at ~/org/*todo.org</td></tr>
</tbody>
</table>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> [ijkl] is how <a href="http://www.ergoemacs.org/emacs/ergonomic_emacs_keybinding.html">ergoemacs</a> defines up/left/down/right, so I keep
the same for consistency. [uo] is left-word right-word, so I also keep
that one.
</p>


<p class="footnote"><sup><a class="footnum" name="fn.2" href="#fnr.2">2</a></sup> The idea of these is to mimic the disposition of
close/minimize/maximize buttons in default unity. Indeed, <sub>çà</sub> are
aligned in this way on AZERTY keyboards.
</p>


</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-06</p>
<p class="author">Author: Léo Perrin &lt;leoperrin@picarresursix.fr&gt;</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
